const rules = [
  {
    "rule": "لا يجوز لغرفة في محكمة النقض التقدم بطلب عدول عن حكم صادر عن الهيئة العامة لمحكمة النقض",
    "decission": "3",
    "year": "2020",
    "court": "الهيئة العامة السباعية"
  },
  {
    "rule": "إن طلب المالك فسخ عقد المزارعة يجب أن يكون بعد إعذاره المزارع بدفع البدل أو الحصة من الإنتاج، وتأخر المزارع عن الدفع لمدة ثلاثة أشهر",
    "decission": "13",
    "year": "2020",
    "court": "الهيئة العامة السباعية"
  },
  {
    "rule": "لا يجوز إعطاء قرار الهيئة العامة مفعولاً رجعياً، وتطبيقه على القرارات الصادرة قبل صدوره",
    "decission": "21",
    "year": "2021",
    "court": "الهيئة العامة السباعية"
  },
  {
    "rule": "إن كل من يرتكب خطأ يتحمل مسؤوليته عن هذا الخطأ وتبعاته القانونية والالتزامات التي أوجبها القانون عليه، ولا يمكن التذرع بأن خطأ الإدارة يجب خطأ الأفراد",
    "decission": "22",
    "year": "2021",
    "court": "الهيئة العامة السباعية"
  },
  {
    "rule": "طعن تبعي - رد الطعن التبعي شكلا - مدعي المخاصمة المدعى عليه لم يستأنف القرار البدائي الصادر برد الدعوى قرار غير سليم قانونا",
    "decission": "2",
    "year": "2020",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "تسمية الخبير من خارج الجدول لا يبطل الخبرة. من حق بعض الورثة المطالبة بالتعويض",
    "decission": "10",
    "year": "2020",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "تفسير القانون واستخلاص النتائج لا يدخل في مضمار الخطأ المهني الجسيم",
    "decission": "14",
    "year": "2020",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "لا ينزل منزلة القانون إلا ما تقرره الهيئة العامة المحكمة النقض السباعية من مبادئ. القرار الناقض واجب الاتباع من ذات الغرفة وللغرفة مصدرة القرار المطعون فيه ما لم يكن مخالف للقانون",
    "decission": "37",
    "year": "2020",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "الوارث كونه خلفاً عاماً للمورث لا يحق له أن يتقدم بدعوى اعتراض الغير على حكم كان مورثه ممثلاً فيه",
    "decission": "66",
    "year": "2020",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "انعدام الحكم يستوجب فقده ركناً أساسياً من أركانه",
    "decission": "78",
    "year": "2020",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "ًإثارة الدفوع أمام المحكمة لا يبنى عليه حكم ما لم يقترن بتقديم ادعاء متقابل أو طلب عارض ودفع رسومه أصولاً. عدم مناقشة دفع جوهري ومؤثر في نتيجة الدعوى يشكل خطأ مهنياً جسيما",
    "decission": "79",
    "year": "2020",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "الوكالة - وجود وكالة قديمة عن الموكل واستعمالها دون العودة إليه مهما مضى الزمن عليها طالما أنها لم تعزل؛ لا يغير من صحة الخصومة والتمثيل. يمكن اعتبار الخصومة صحيحة إذا شرع بها دون تبليغ المدعى عليهم فيما لو حضر ممثل عنهم بوكالة بالخصومة صحيحة وتمثلهم تمثيلاً صحيحاً",
    "decission": "97",
    "year": "2020",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "الخطأ القانوني لا يكون خطأ مهنيا جسيما إلا إذا خالف الحدود الدنيا للقانون، أو تجاهل الوقائع الثابتة بالدعوى. لا يجوز إثارة أسباب جديدة لم يسبق أن تمسك بها طالب المخاصمة أمام محاكم الأساس. حرية التقدير ومهما بلغ الخطأ فيها وتفسير القانون لا يمكن أن تكون ضمن حالات الخطأ المهني الجسيم",
    "decission": "116",
    "year": "2020",
    "court": "الهيئة العامة المدنية - ايجار"
  },
  {
    "rule": "لم يشترط القانون في حضور جلسات المحاكمة أمام محكمة النقض أن يكون ممن له ممارسة في المحاماة مدة عشر سنوات",
    "decission": "121",
    "year": "2020",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "خطأ موظف الديوان أو إهماله لا يجوز أن ينعكس على مصلحة الطاعن",
    "decission": "131",
    "year": "2020",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "من غير الممكن سلوك طريق اعتراض الغير على القرار الصادر في دعوى المخاصمة. لا يجوز لغير أطراف القرار المشكو منه مباشرة دعوى المخاصمة، وبالتالي ليس من حق المعترض اعتراض الغير إقامة مثل هكذا دعوى",
    "decission": "183",
    "year": "2020",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "الوكالة - شرح الوكيل على سند التبليغ بأنه لم يعد وكيلا يبقى قولا مرسلا إذا لم يؤيد بسند العزل الاعتزال أصولاً",
    "decission": "187",
    "year": "2020",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "الأخذ بالخبرة أو هدرها أو إعادتها أو الاستيضاح حولها؛ هي من الأمور الموضوعية التي يعود أمر تقديرها لمحكمة الموضوع",
    "decission": "189",
    "year": "2020",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "انعدام - إغفال بعض أسماء أفراد الجهة المدعى عليها بالمخاصمة من ديباجة القرار ومقدمته على الرغم من تبليغهم لائحة الدعوى أصولا ليس إلا من قبيل الأخطاء المادية والكتابية",
    "decission": "206",
    "year": "2020",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "لا يجوز إقامة أكثر من دعوى مخاصمة على ذات القرار المشكو منه وهيئة المحكمة التي أصدرته",
    "decission": "213",
    "year": "2020",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "يجوز اعتبار الإقرار بوجود الحق وسيلة من الوسائل التي يتنازل بها صاحب الحق عن التقادم",
    "decission": "8",
    "year": "2021",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "يجب تحت طائلة الرد شكلا تقديم استدعاء الطعن من قبل محام أستاذ مضى على تسجيله في الجدول مدة لا تقل عن عشر سنوات - العبرة لشخص المحامي الذي قدم الطعن وأقره",
    "decission": "17",
    "year": "2021",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "إعادة المحاكمة - طلب سماع أقوال الشهود لإثبات أن العقد مخالف للنظام العام ليس له مستند قانوني بدعوى إعادة المحاكمة",
    "decission": "31",
    "year": "2021",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "لا يجوز أن تبقى إشارة الدعوى سارية المفعول بعد حسم الدعوى سواء أكان الرد لعدم الاختصاص أو لعدم القبول لوجود المشارطة على التحكيم",
    "decission": "54",
    "year": "2021",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "تبليغ استدعاء الطعن المجهول الإقامة... حالتان",
    "decission": "58",
    "year": "2021",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "اتباع القرار الناقض مشروط بعدم مخالفته لاجتهاد الهيئة العامة لمحكمة النقض، وصريح نص القانون ووقائع الدعوى",
    "decission": "74",
    "year": "2021",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "صحة التمثيل والخصومة - لكل من رئيس الاتحاد العام للحرفيين ورئيس الجمعية الحرفية حق التمثيل أمام القضاء",
    "decission": "103",
    "year": "2021",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "عدم رد الأكثرية على مخالفة الرئيس وإن كانت تعد سبباً لنقض القرار إلا أنها لا تشكل خطاً مهنياً جسيماً",
    "decission": "144",
    "year": "2021",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "صحة تمثيل وخصومة - الطعن المقدم من الطاعن الشريك المتضامن شخصيا ضمن شركة تضامنية تكون الخصومة فيه صحيحة",
    "decission": "192",
    "year": "2021",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "اشتراك أحد القضاة في إصدار قرار مستعجل لا يحجب عنه قانونا المشاركة في إصدار الحكم الفاصل بالموضوع",
    "decission": "402",
    "year": "2021",
    "court": "الهيئة العامة المدنية - أصول"
  },
  {
    "rule": "منع معارضة - ليس من صلاحية المحكمة الناظرة بدعوى منع المعارضة سنداً لملكية المدعي في السجل العقاري أن تناقش ما إذا كانت هذه الملكية مستندة إلى سبب صحيح أم لا",
    "decission": "29",
    "year": "2020",
    "court": "الهيئة العامة المدنية - مدني"
  },
  {
    "rule": "بيع الوفاء - بيع الوفاء باطل ولا يصلح أن يكون ورقة ضد",
    "decission": "49",
    "year": "2020",
    "court": "الهيئة العامة المدنية - مدني"
  },
  {
    "rule": "مزارعة - المزارعة لا تقوم على وضع اليد مهما طال الزمن",
    "decission": "205",
    "year": "2020",
    "court": "الهيئة العامة المدنية - مدني"
  },
  {
    "rule": "عقد الاستثمار ليس من العقود المسماة، وإنما هو عقد يخضع لسلطان الإرادة الحرة",
    "decission": "125",
    "year": "2021",
    "court": "الهيئة العامة المدنية - مدني"
  },
  {
    "rule": "تنازع قوانين - محاكم الطرف المتعاقد الذي يوجد في إقليمه موقع العقار مختصة بالفصل في الحقوق العينية المتعلقة به",
    "decission": "168",
    "year": "2021",
    "court": "الهيئة العامة المدنية - مدني"
  },
  {
    "rule": "في حال الاختلاف بين أوصاف العقار ورقمه فيؤخذ برقم العقار",
    "decission": "19",
    "year": "2020",
    "court": "الهيئة العامة المدنية - عقاري"
  },
  {
    "rule": "تسجيل الحقوق العينية العقارية في السجل العقاري هو عمل إداري لا قضائي، ولا يوجد ما يمنع قانونا من تقديم الدليل على خلافها سواء بالطعن بالتزوير أم بغيره",
    "decission": "190",
    "year": "2020",
    "court": "الهيئة العامة المدنية - عقاري"
  },
  {
    "rule": "لا يجوز وضع إشارة الدعوى على صحيفة عقار مالكه ليس طرفا أو ممثلاً بالدعوى",
    "decission": "151",
    "year": "2021",
    "court": "الهيئة العامة المدنية - عقاري"
  },
  {
    "rule": "مبدأ الأسبقية في الإشارة يطبق عندما يتعلق الأمر بالإشارات الموضوعة على ذات الحق وبين الخصوم أنفسهم",
    "decission": "250",
    "year": "2021",
    "court": "الهيئة العامة المدنية - عقاري"
  },
  {
    "rule": "ثبوت مخالفة البناء لأنظمة ضابطة البناء لا يحول دون الحكم بتثبيت العقد المنصب بالأصل على حصة سهمية خاصة",
    "decission": "335",
    "year": "2021",
    "court": "الهيئة العامة المدنية - عقاري"
  },
  {
    "rule": "مجرد إبراز صور فواتير غير كاف بحد ذاته لمساءلة الجهة المدعى عليها بمخالفة الاستيراد تهريباً",
    "decission": "179",
    "year": "2020",
    "court": "الهيئة العامة المدنية - جمركي"
  },
  {
    "rule": "* إنكار الجهة المدعى عليها ما نسب إليها ليس من شأنه التبرئة طالما أن الاعترافات تأيدت بمصادرة البضاعة المهربة",
    "decission": "185",
    "year": "2020",
    "court": "الهيئة العامة المدنية - جمركي"
  },
  {
    "rule": "إثبات جرم التهريب يحتاج إلى أدلة قاطعة وجازمة",
    "decission": "211",
    "year": "2021",
    "court": "الهيئة العامة المدنية - جمركي"
  },
  {
    "rule": "استجواب - توجيه اليمين الحاسمة غير مرتبط بالاستجواب. قبول البيئة الشخصية بحال غياب المدعى عليه لا يحجب حق المحكمة بالرجوع عن قبولها عند حضور المدعى عليه",
    "decission": "212",
    "year": "2020",
    "court": "الهيئة العامة المدنية - بينات"
  },
  {
    "rule": "تقييم الخبرة والموازنة بين الأدلة هو من إطلاقات محكمة الموضوع",
    "decission": "213",
    "year": "2021",
    "court": "الهيئة العامة المدنية - بينات"
  },
  {
    "rule": "لا يوجد ما يمنع المحكمة أن تستمع لأدلة جديدة بعد أن حلفت أحد أطراف الدعوى اليمين المتممة",
    "decission": "263",
    "year": "2021",
    "court": "الهيئة العامة المدنية - بينات"
  },
  {
    "rule": "إن اقتناع المحكمة بأدلة معينة هو مما يدخل في حدود سلطتها التقديرية ولا يمكن وصفه بالخطأ المهني الجسيم، الخطأ المهني الجسيم لا يشمل في مداه الخطأ في التقدير أو في استخلاص النتائج القانونية أو في التفسير والتأويل والترجيح أو في مسائل الفهم",
    "decission": "276",
    "year": "2021",
    "court": "الهيئة العامة المدنية - بينات"
  },
  {
    "rule": "إذا عارض الخصم بشهادة الشهود إلا أن المحكمة استجابت لطلب خصمه وقررت الاستماع إلى هذه البينة، وتقدم المعارض وطلب الاستماع لشهود البينة العكسية وأجيب طلبه فليس له بعدئذ التذرع بأنه يعارض إثبات الدعوى بالبيئة الشخصية",
    "decission": "306",
    "year": "2021",
    "court": "الهيئة العامة المدنية - بينات"
  },
  {
    "rule": "الشهادة - وجود دعوى جزائية بحق أحد الشهود بجرم الشهادة الكاذبة التي أدلى بها في هذه الدعوى لا يمكن أن يشكل مانعاً من الشهادة أو يحول دون الأخذ بشهادته. ثبوت جرم شهادة الزور يشكل سبباً لإعادة المحاكمة وليس سبباً لعدم الأخذ بالشهادة بالنسبة للدعوى المشهود فيها",
    "decission": "308",
    "year": "2021",
    "court": "الهيئة العامة المدنية - بينات"
  },
  {
    "rule": "القصور في تعليل الحكم وعدم الرد على الدفوع لا يشكل خطأ مهنياً جسيما إذا انتهى الحكم إلى ما يتفق وحكم القانون.اليمين الحاسمة.. صلاحية القاضي في عدم توجيهها. إعادة الخبرة ليس متروكا لرغبة الخصوم",
    "decission": "329",
    "year": "2021",
    "court": "الهيئة العامة المدنية - بينات"
  },
  {
    "rule": "الإخلاء لعلة التملك - يسري التقادم من تاريخ علم المؤجر بتملك المستأجر داراً صالحة لسكناه. إن عبء إثبات العلم بالتملك يقع على المستأجر",
    "decission": "8",
    "year": "2020",
    "court": "الهيئة العامة المدنية - إيجار"
  },
  {
    "rule": "خصومة - الادعاء في دعاوى التخمين فيما يخص تعديل أجور كامل العقار مسموع ممن يملك أغلبية السهام. إذا قدمت الدعوى أصالة وإضافة للتركة ممثلة بكافة الورثة أو من يحقق الصفة في الادعاء من الورثة بحسب حصصهم؛ يكون الادعاء صحيحا وتبقى عبارة إضافة للتركة زائدة",
    "decission": "32",
    "year": "20",
    "court": "الهيئة العامة المدنية - إيجار"
  },
  {
    "rule": "إنهاء العلاقة الإيجارية من حق مالك العقار المؤجر للسكن. إذا كانت صفة الاستخدام هي صفة مزدوجة فإن تخمين المأجور على أساس أنه للسكن لا يفقد المستأجر حقه باستعماله على أي وجه من الوجوه المتفق عليها بالعقد",
    "decission": "108",
    "year": "2020",
    "court": "الهيئة العامة المدنية - إيجار"
  },
  {
    "rule": "القيود المالية لا تصلح دليلاً على صحة التنازل عن العقار المأجور. تواجد الطاعن في العين المؤجرة من قبيل الإشغال ولا يثبت العلاقة الإيجارية",
    "decission": "184",
    "year": "2020",
    "court": "الهيئة العامة المدنية - إيجار"
  },
  {
    "rule": "تخمين - القضاء العادي هو صاحب الولاية العامة حتى لو كانت محافظة دمشق طرفاً في الدعوى. إن تسديد الجهة المدعية الأصلية لبدل الإيجار المحدد من المحافظة انفراداً هو طغيان على العقد",
    "decission": "66",
    "year": "2021",
    "court": "الهيئة العامة المدنية - إيجار"
  },
  {
    "rule": "العبرة في اعتبار الأرض سكنية أو زراعية لغرض تقدير الأجرة عنها ليس في جنسها المثبت في السجل العقاري وإنما لطبيعة استغلالها وواقع حالها",
    "decission": "67",
    "year": "2021",
    "court": "الهيئة العامة المدنية - إيجار"
  },
  {
    "rule": "الحقوق الناشئة عن عقد الإيجار تسقط بالتقادم",
    "decission": "69",
    "year": "2021",
    "court": "الهيئة العامة المدنية - إيجار"
  },
  {
    "rule": "الهلاك الكلي وبمجرد حصوله ينفسخ عقد الإيجار تلقائياً",
    "decission": "277",
    "year": "2021",
    "court": "الهيئة العامة المدنية - إيجار"
  },
  {
    "rule": "عقد الاستثمار هو عقد يقع على المتجر بعناصره المادية والمعنوية، فإذا لم تتوفر هذه العناصر فإن العقد عقد إيجار. واقعة الإشغال من الوقائع المادية التي يجوز إثباتها بكل وسائل الإثبات",
    "decission": "313",
    "year": "2021",
    "court": "الهيئة العامة المدنية - إيجار"
  },
  {
    "rule": "دعوى غصب العقار إذا ما تم ردها لا تنفي العلاقة الإيجارية غير المبنية على غصب العقار. من يؤجر العقار هو من يملك الحق بطلب إخلاء المستأجر. إن رئيس التنفيذ يملك الحق بإعطاء المهلة القانونية لإخلاء المأجور عندما يوضع الحكم بالتنفيذ",
    "decission": "396",
    "year": "2021",
    "court": "الهيئة العامة المدنية - إيجار"
  },
  {
    "rule": "إن تصريح المدعي أمام محكمة الدرجة الأولى أنه ليس لديه شهود في الوقت الراهن؛ فإن ذلك لا يحجب عنه تسمية شهوده شهود الإثبات أمام محكمة الدرجة الثانية",
    "decission": "13",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "على محكمة الموضوع اختيار إحدى الخبرات التي أجرتها وتراها صحيحة. يُقبل استئناف المدعي الشخصي ولو لم تستأنف النيابة العامة، وفي هذه الحالة تنشر الدعوى الشخصية فقط",
    "decission": "41",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "قرار محكمة الصلح القاضي بالحبس عشرة أيام يقبل الاستئناف، وقرار الاستئناف يقبل الطعن بالنقض إذا قررت محكمة الاستئناف فسخ القرار وإسقاط الدعوى بالتقادم",
    "decission": "94",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "ليس في القانون ما يوجب على محكمة الاستئناف أن تدون مطالبة النيابة العامة في فقرات قرارها. عدم إبداء النيابة العامة مطالبتها في دعوى إساءة الأمانة لا يعيب الإجراءات",
    "decission": "157",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "التفات المحكمة عن دفع جوهري يوقع المحكمة في الخطأ المهني الجسيم",
    "decission": "201",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "تقدير الأدلة من إطلاقات محكمة الموضوع. إن عدم الرد على الدفوع لا يشكل خطأً مهنياً جسيما ًإذا كان الحكم سليماً من حيث النتيجة",
    "decission": "205",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "الاتهام يقوم على أدلة الترجيح وليس اليقين، وإن أدلة اليقين من عمل محاكم الموضوع ولها سلطة إعطاء الوصف الحقيقي للفعل الجرمي. إعمال مفاعيل مراسيم العفو التي تشمل جزءً من العقوبة ليس من مهام سلطة التحقيق؛ وإنما يعود تطبيقها لمحاكم الموضوع",
    "decission": "267",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "الإيجاز في التعليل و القصور في التسبيب سبباً للنقض، ولكن لا يرقى لدرجة الخطأ المهني الجسيم. عدم تلاوة الأوراق عند حصول تبدل في الهيئة لا يصل إلى درجة الخطأ المهني الجسيم",
    "decission": "283",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "يجب صدور قرار عن مجلس التأديب التابع له الشرطي بإحالته إلى القضاء ليصار إلى تحريك الدعوى العامة بحقه بجرم الرشوة",
    "decission": "41",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "التقادم يمنع القضاء الجزائي من التصدي للحقوق الشخصية",
    "decission": "104",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "إذا سكت الورثة عن استعمال حقهم في البطلان النسبي في الحكم لسبب وفاة مورثهم خلال سير الدعوى واكتسب القرار الصادر بحق مورثهم الدرجة القطعية؛ صار للحكم حجية الأمر المقضي به، حتى ولو كان مشوباً بعيب في الشكل أو الموضوع أو اشتمل على خطأ في تطبيق القانون، ولو كان مخالفاً للنظام العام",
    "decission": "161",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "مخاصمة القرار الصادر عقب الطعن أولاً من قبل طالب المخاصمة وعدم مخاصمة القرار الصادر بعده عقب الطعن ثانية بأمر خطي من السيد وزير الدفاع يجعل الخصومة غير صحيحة",
    "decission": "175",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "إن الانعدام لا يوجه إلى أعضاء المحكمة مصدري القرار بل إلى المحكمة مصدرة القرار. لا يمنع المدعي بالانعدام من الادعاء مجدداً بدعوى الانعدام مادامت قد رُدَّت شكلاً. إن اشتراك القاضي ذاته في إصدار قرارين في مرحلتي التقاضي في ذات الدعوى يجعل القرار الثاني معدوماً",
    "decission": "191",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "الطرف والخصم الرئيس في دعوى الحق العام هي النيابة العامة، وعدم مخاصمتها في دعوى المخاصمة يستوجب الرد شكلاً",
    "decission": "295",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "جرم الرشوة المسند إلى عسكري أثناء قيامه بعمله من اختصاص القضاء العسكري",
    "decission": "314",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "إن وفاة أحد المدعى عليهم بالقضية وتوجيه الاتهام إليه لا يؤثر على صحة القرار، كون التمسك بذلك الدفع يعود لخلف المتوفى من ورثته",
    "decission": "345",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "دعوى الانعدام دعوى مبتدئة ترفع أمام ذات المحكمة، وقرارها کاشف وليس منشئ",
    "decission": "352",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "دعوى المخاصمة لا تقبل ممن رضخ للحكم. الوكالة بالخصومة في دعوى المخاصمة تحتاج إلى نص خاص بالتوكيل بمواجهة الحق العام",
    "decission": "391",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "القرارات التي تقبل المخاصمة هي القرارات الباتة في الموضوع",
    "decission": "479",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "عدم دراسة الدعوى دراسة كافية؛ وتعجيل المحكمة أمرها دون الالتفات إلى الدفوع المثارة والحاسمة؛ يوجب إبطال القرار، ويدخل المحكمة في دائرة الخطأ المهني الجسيم",
    "decission": "480",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - أصول"
  },
  {
    "rule": "القناعة الجزائية يمكن تكوينها من أدلة وقرائن تشكل بمجملها دليلاً قاطعاً",
    "decission": "91",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - إثبات"
  },
  {
    "rule": "الأخذ بالأقوال الأولية وتوافق هذه الأقوال مع أقوال باقي المدعى عليهم. العطف الجرمي. اعتراف الشريك على شريكه",
    "decission": "291",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - إثبات"
  },
  {
    "rule": "اعتماد الحكم على أدلة مفترضة أو مشكوك بصحتها . عدم إعطاء الدعوى العناية الكافية",
    "decission": "91",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - إثبات"
  },
  {
    "rule": "الأقوال المنتزعة بالإكراه لدى رجال الأمن كدليل وحيد للإدانة لا تُعتمد مالم تؤكد بدليل آخر ",
    "decission": "286",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - إثبات"
  },
  {
    "rule": "تقدير الأدلة ووزنها من قبل القاضي من مسائل الواقع",
    "decission": "289",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - إثبات"
  },
  {
    "rule": "الخبرة كدليل تخضع لتقدير محكمة الموضوع وتقرير الخبرة لا يُكسب حقاً لأي طرف من أطراف الدعوى ما لم يقترن بحكم قضائي. عدم إجابة المحكمة الناظرة بالموضوع المطلوب إعادة الخبرة لا يشكل أي خطأ مهني جسيم",
    "decission": "333",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - إثبات"
  },
  {
    "rule": "تقدير الأدلة لا يدخل في إطار الأخطاء المهنية الجسيمة",
    "decission": "410",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - إثبات"
  },
  {
    "rule": "الضبط الأمني المقترن بمصادرة المواد المخدرة يصلح دليلاً للإثبات",
    "decission": "446",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - إثبات"
  },
  {
    "rule": "جرم الشيك بدون رصيد يتحقق بمجرد التسليم، ولا يتأثر بالسبب أو الباعث، وفي حال خلوه من التاريخ تكون العبرة لتاريخ عرضه على المصرف",
    "decission": "17",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - عقوبات"
  },
  {
    "rule": "عدم التثبت من توافر أركان الجرم وخاصة النية الجرمية والقصد الجرمي يعد خطأ مهنياً جسيماً",
    "decission": "29",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - عقوبات"
  },
  {
    "rule": "إن تقديم المخبر أكثر من إخبار بحق المُخبَر عنه و صدور حكمين قضائيين مبرمين ببراءة الأخير مما نسبه المُخبِر إليه هو أساس ثبوت ارتكاب المُخبِر لجرم الافتراء",
    "decission": "35",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - عقوبات"
  },
  {
    "rule": "إن تقرير منع المحاكمة عن جرم لا يفي بالضرورة أن يكون المدعي مفترياً على خصمه",
    "decission": "45",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - عقوبات"
  },
  {
    "rule": "إساءة الأمانة - إنذار - لا يشترط إنذار الأمين الذي يرغب في تملك المال إضراراً بصاحبه",
    "decission": "67",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - عقوبات"
  },
  {
    "rule": "أوجبت الاجتهادات القانونية المستقرة على محكمة الموضوع بحال حجبت الأسباب المخففة التقديرية عن المحكوم لديها أن تعلل سبب حجبها لهذه الأسباب، وإلا سيكون القرار عرضة للنقض لهذا السبب",
    "decission": "155",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - عقوبات"
  },
  {
    "rule": "سند الأمانة لا يجوز التخلص منه إلا إذا كان منشأ الدين مخالفاً لأحكام القانون",
    "decission": "206",
    "year": "2020",
    "court": "الهيئة العامة الجزائية - عقوبات"
  },
  {
    "rule": "منح الأسباب المخففة التقديرية من إطلاقات محكمة الموضوع",
    "decission": "139",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - عقوبات"
  },
  {
    "rule": "جرم التزوير - أركانه - انتفاء الضرر يؤدي إلى انتفاء الجرم",
    "decission": "179",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - عقوبات"
  },
  {
    "rule": "مساهمة جرمية - على قاضي الموضوع تحديد دور كل شخص في الواقعة الجرمية",
    "decission": "244",
    "year": "2021",
    "court": "الهيئة العامة الجزائية - عقوبات"
  },
  {
    "rule": "إن وثيقة حصر الإرث الصادرة عن المرجعية الدينية الروحية يكون النظر بإبطالها من اختصاص المحاكم الروحية، ولا ولاية للقضاء الشرعي. إثبات نسب الطفل غير جائز باليمين المتممة",
    "decission": "4",
    "year": "2020",
    "court": "الهيئة العامة - أحوال شخصية"
  },
  {
    "rule": "اشتمال سند التوكيل على حق الطلاق يستدعي قبوله في دعوى التفريق. عبارة توكيل المحامي بالخصومة والمحاكمة بأي خصوص يخوله الادعاء بطلب التفريق بخلاف الطلاق الذي يحتاج إلى نص خاص. استحقاق المهر في حال التفريق",
    "decission": "6",
    "year": "2020",
    "court": "الهيئة العامة - أحوال شخصية"
  },
  {
    "rule": "الصورية في المخالعة. خلو أوراق الدعوى مما يشير إلى تبادل الإيجاب والقبول يجعل المخالعة غير واقعة شرعاً",
    "decission": "2",
    "year": "2021",
    "court": "الهيئة العامة - أحوال شخصية"
  },
  {
    "rule": "نفي النسب يجب أن يكون في أوقات التهنئة الأولى للمولود",
    "decission": "7",
    "year": "2021",
    "court": "الهيئة العامة - أحوال شخصية"
  },
  {
    "rule": "المصاغ الذهبي الذي يُلزَم الزوج بدفع قيمته للزوجة يتم تقدير قيمته بتاريخ التنفيذ",
    "decission": "18",
    "year": "2021",
    "court": "الهيئة العامة - أحوال شخصية"
  },
  {
    "rule": "امتناع الإدارة عن تنفيذ الحكم القضائي القطعي يعد من قبيل الاعتداء المادي، ويجعل القضاء العادي مختصاً",
    "decission": "1",
    "year": "2020",
    "court": "غرفة تنازع الإختصاص المدنية"
  },
  {
    "rule": "المنازعة التي تنشأ عن صحة القيد المسجل وإلغاؤها؛ إنما يعود أمر النظر فيها إلى القضاء العادي، لأن الخلاف ليس حول منح المدعى عليهم الجنسية وإنما حول صحة القيد من عدمها",
    "decission": "6",
    "year": "2020",
    "court": "غرفة تنازع الإختصاص المدنية"
  },
  {
    "rule": "إن مباشرة الجهة المدعى عليها أعمالها قبل استملاك العقار موضوع الدعوى، وقبل تعديل الصفة التنظيمية للعقار يعد اعتداء على الملكية، وعليه فإن أمر النظر بموضوع الدعوى يعود للقضاء العادي صاحب الولاية الشاملة، سيما وأنه لا يوجد قرار إداري تطلب الجهة المدعية إلغاءه",
    "decission": "7",
    "year": "2020",
    "court": "غرفة تنازع الإختصاص المدنية"
  },
  {
    "rule": "إن عقد التأمين بين الشركة العامة لمصفاة حمص ومؤسسة التأمين السورية ليس من العقود الإدارية وإن النزاع المستند إلى هذا العقد إنما يعود أمر النظر فيه إلى القضاء العادي",
    "decission": "2",
    "year": "2021",
    "court": "غرفة تنازع الإختصاص المدنية"
  },
  {
    "rule": "حيث إن محكمة تنازع الاختصاص هي هيئة ذات طبيعة خاصة؛ وبالتالي فلا سبيل للقول بعد ذلك بأن اشتراك رئيس محكمة النقض ونائبه يجعل القرار صادر عن هيئة مشكلة تشكيلاً غير صحيح، ما دام قانون السلطة القضائية قد نظم هذا الأمر، ولا سبيل للقياس على أحكام قانون أصول المحاكمات",
    "decission": "3",
    "year": "2021",
    "court": "غرفة تنازع الإختصاص المدنية"
  }
]

function generateRule() {
  const randomIndex = Math.floor(Math.random() * rules.length);
  const selectedRule = rules[randomIndex];

  document.getElementById("rule-box").innerHTML = `
      <p>${selectedRule.rule}</p>
      <p class="desission-number">رقم القرار: ${selectedRule.decission} لعام ${selectedRule.year}</p>
      <p>صادر عن ${selectedRule.court}</p>
  `;
}

// توليد اجتهاد عند تحميل الصفحة
generateRule();

// إضافة حدث للزر
document.querySelector(".generateButton").addEventListener("click", generateRule);